0013-pi-part-2/pi-sb-4096.output
write: (g=0): rw=write, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=io_uring_cmd, iodepth=32
read: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=io_uring_cmd, iodepth=32
fio-3.35-126-ge2c5f
Starting 2 threads
Jobs: 1 (f=1): [_(1),R(1)][100.0%][r=146MiB/s][r=18.7k IOPS][eta 00m:00s]
write: (groupid=0, jobs=1): err= 0: pid=4511: Wed Sep 20 01:36:02 2023
  write: IOPS=33.8k, BW=264MiB/s (277MB/s)(1024MiB/3875msec); 0 zone resets
    slat (usec): min=16, max=1121, avg=23.03, stdev=22.80
    clat (nsec): min=581, max=6162.4k, avg=921957.70, stdev=351174.47
     lat (usec): min=126, max=6256, avg=944.98, stdev=352.07
    clat percentiles (usec):
     |  1.00th=[  289],  5.00th=[  363], 10.00th=[  441], 20.00th=[  586],
     | 30.00th=[  709], 40.00th=[  824], 50.00th=[  922], 60.00th=[ 1029],
     | 70.00th=[ 1139], 80.00th=[ 1237], 90.00th=[ 1352], 95.00th=[ 1467],
     | 99.00th=[ 1713], 99.50th=[ 1795], 99.90th=[ 1975], 99.95th=[ 2114],
     | 99.99th=[ 4817]
   bw (  KiB/s): min=255104, max=278800, per=99.92%, avg=270392.71, stdev=7805.51, samples=7
   iops        : min=31888, max=34850, avg=33799.00, stdev=975.69, samples=7
  lat (nsec)   : 750=0.01%
  lat (usec)   : 50=0.02%, 100=0.03%, 250=0.16%, 500=13.32%, 750=20.08%
  lat (usec)   : 1000=23.67%
  lat (msec)   : 2=42.63%, 4=0.07%, 10=0.02%
  cpu          : usr=61.15%, sys=20.81%, ctx=2737, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
read: (groupid=1, jobs=1): err= 0: pid=4512: Wed Sep 20 01:36:02 2023
  read: IOPS=19.5k, BW=153MiB/s (160MB/s)(1024MiB/6711msec)
    slat (usec): min=8, max=2833, avg=34.42, stdev=13.37
    clat (usec): min=46, max=12183, avg=1586.98, stdev=277.91
     lat (usec): min=84, max=12194, avg=1621.40, stdev=283.86
    clat percentiles (usec):
     |  1.00th=[ 1500],  5.00th=[ 1500], 10.00th=[ 1516], 20.00th=[ 1516],
     | 30.00th=[ 1532], 40.00th=[ 1532], 50.00th=[ 1582], 60.00th=[ 1598],
     | 70.00th=[ 1614], 80.00th=[ 1631], 90.00th=[ 1663], 95.00th=[ 1680],
     | 99.00th=[ 1696], 99.50th=[ 1713], 99.90th=[ 8291], 99.95th=[ 9372],
     | 99.99th=[10159]
   bw (  KiB/s): min=144496, max=163680, per=100.00%, avg=156384.00, stdev=6257.99, samples=13
   iops        : min=18062, max=20460, avg=19548.15, stdev=782.43, samples=13
  lat (usec)   : 50=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.84%, 4=0.01%, 10=0.12%, 20=0.03%
  cpu          : usr=33.61%, sys=66.38%, ctx=11, majf=0, minf=0
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=131072,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=264MiB/s (277MB/s), 264MiB/s-264MiB/s (277MB/s-277MB/s), io=1024MiB (1074MB), run=3875-3875msec

Run status group 1 (all jobs):
   READ: bw=153MiB/s (160MB/s), 153MiB/s-153MiB/s (160MB/s-160MB/s), io=1024MiB (1074MB), run=6711-6711msec