0013-pi-part-2/pi-sb-512.output
write: (g=0): rw=write, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=io_uring_cmd, iodepth=1
read: (g=1): rw=read, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=io_uring_cmd, iodepth=1
fio-3.35-126-ge2c5f
Starting 2 threads
Jobs: 1 (f=1): [_(1),R(1)][100.0%][r=9.88MiB/s][r=20.2k IOPS][eta 00m:00s]
write: (groupid=0, jobs=1): err= 0: pid=4474: Wed Sep 20 01:20:43 2023
  write: IOPS=19.1k, BW=9543KiB/s (9772kB/s)(1024MiB/109876msec); 0 zone resets
    slat (usec): min=7, max=305, avg= 8.85, stdev= 1.13
    clat (nsec): min=415, max=66444k, avg=42774.55, stdev=70168.33
     lat (usec): min=40, max=66453, avg=51.62, stdev=70.23
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   37], 10.00th=[   37], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   40], 50.00th=[   42], 60.00th=[   43],
     | 70.00th=[   44], 80.00th=[   46], 90.00th=[   49], 95.00th=[   57],
     | 99.00th=[   76], 99.50th=[   79], 99.90th=[   90], 99.95th=[  100],
     | 99.99th=[  161]
   bw (  KiB/s): min= 6988, max=10922, per=99.99%, avg=9542.78, stdev=629.86, samples=219
   iops        : min=13976, max=21844, avg=19085.63, stdev=1259.71, samples=219
  lat (nsec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 20=0.01%, 50=91.74%, 100=8.21%
  lat (usec)   : 250=0.04%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 50=0.01%, 100=0.01%
  cpu          : usr=6.71%, sys=22.88%, ctx=2097233, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read: (groupid=1, jobs=1): err= 0: pid=4479: Wed Sep 20 01:20:43 2023
  read: IOPS=18.6k, BW=9290KiB/s (9512kB/s)(1024MiB/112877msec)
    slat (usec): min=7, max=847, avg= 9.19, stdev= 5.25
    clat (nsec): min=422, max=1061.9k, avg=43866.26, stdev=40023.71
     lat (usec): min=39, max=1131, avg=53.05, stdev=45.02
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   36], 10.00th=[   36], 20.00th=[   37],
     | 30.00th=[   38], 40.00th=[   38], 50.00th=[   39], 60.00th=[   40],
     | 70.00th=[   43], 80.00th=[   44], 90.00th=[   46], 95.00th=[   51],
     | 99.00th=[   80], 99.50th=[  469], 99.90th=[  553], 99.95th=[  562],
     | 99.99th=[  644]
   bw (  KiB/s): min=  845, max=11050, per=99.98%, avg=9288.39, stdev=2542.99, samples=225
   iops        : min= 1690, max=22100, avg=18576.77, stdev=5085.97, samples=225
  lat (nsec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 20=0.01%, 50=94.71%, 100=4.47%
  lat (usec)   : 250=0.05%, 500=0.41%, 750=0.35%, 1000=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=6.65%, sys=23.36%, ctx=2097220, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2097152,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=9543KiB/s (9772kB/s), 9543KiB/s-9543KiB/s (9772kB/s-9772kB/s), io=1024MiB (1074MB), run=109876-109876msec

Run status group 1 (all jobs):
   READ: bw=9290KiB/s (9512kB/s), 9290KiB/s-9290KiB/s (9512kB/s-9512kB/s), io=1024MiB (1074MB), run=112877-112877msec